espressif/esp-idf/components/soc/esp32s31/register/soc/spi1_mem_c_struct.h
typedef struct spi1_mem_c_dev_s {
    volatile spi1_mem_c_cmd_reg_t cmd;
    volatile uint32_t addr;
    volatile spi1_mem_c_ctrl_reg_t ctrl;
    volatile spi1_mem_c_ctrl1_reg_t ctrl1;
    volatile spi1_mem_c_ctrl2_reg_t ctrl2;
    volatile spi1_mem_c_clock_reg_t clock;
    volatile spi1_mem_c_user_reg_t user;
    volatile spi1_mem_c_user1_reg_t user1;
    volatile spi1_mem_c_user2_reg_t user2;
    volatile spi1_mem_c_mosi_dlen_reg_t mosi_dlen;
    volatile spi1_mem_c_miso_dlen_reg_t miso_dlen;
    volatile spi1_mem_c_rd_status_reg_t rd_status;
    uint32_t reserved_030;
    volatile spi1_mem_c_misc_reg_t misc;
    volatile spi1_mem_c_tx_crc_reg_t tx_crc;
    volatile spi1_mem_c_cache_fctrl_reg_t cache_fctrl;
    uint32_t reserved_040[6];
    volatile uint32_t data_buf[16];
    volatile spi1_mem_c_flash_waiti_ctrl_reg_t flash_waiti_ctrl;
    volatile spi1_mem_c_flash_sus_ctrl_reg_t flash_sus_ctrl;
    volatile spi1_mem_c_flash_sus_cmd_reg_t flash_sus_cmd;
    volatile spi1_mem_c_sus_status_reg_t sus_status;
    uint32_t reserved_0a8[6];
    volatile spi1_mem_c_int_ena_reg_t int_ena;
    volatile spi1_mem_c_int_clr_reg_t int_clr;
    volatile spi1_mem_c_int_raw_reg_t int_raw;
    volatile spi1_mem_c_int_st_reg_t int_st;
    uint32_t reserved_0d0;
    volatile spi1_mem_c_ddr_reg_t ddr;
    uint32_t reserved_0d8[42];
    volatile spi1_mem_c_timing_cali_reg_t timing_cali;
    uint32_t reserved_184[31];
    volatile spi1_mem_c_clock_gate_reg_t clock_gate;
    uint32_t reserved_204[126];
    volatile spi1_mem_c_date_reg_t date;
} spi1_mem_c_dev_t;

#ifndef __cplusplus
_Static_assert(sizeof(spi1_mem_c_dev_t) == 0x400, "Invalid size of spi1_mem_c_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
